Revit 2026 API

# ConduitSizeSettingIterator Class

---

An iterator to a set of items from ConduitSizeSettings. Each item is a KeyValuePair(System::String^, ConduitSizes). ElementId is the id of the conduit standard type.

SystemObject Autodesk.Revit.DB.ElectricalConduitSizeSettingIterator

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ConduitSizeSettingIterator : IEnumerator<KeyValuePair<string, ConduitSizes>>
```
```vb
Public Class ConduitSizeSettingIterator
	Implements IEnumerator(Of KeyValuePair(Of String, ConduitSizes))
```
```cpp
public ref class ConduitSizeSettingIterator : IEnumerator<KeyValuePair<String^, ConduitSizes^>>
```
```fsharp
type ConduitSizeSettingIterator =
    class
        interface IEnumerator<KeyValuePair<string, ConduitSizes>>
    end
```

The ConduitSizeSettingIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets the item at the current position of the iterator. |
|  | CurrentObject |  |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ConduitSizeSettingIterator |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | HasCurrent | Identifies whether the iterator has a current item. There is no current item if the iterator has not started yet or has been done. |
|  | IsDone | Identifies if the iteration has completed. |
|  | MoveNext | Increments the enumerator to the next item. |
|  | Reset | Resets the iterator to the initial state. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Electrical Namespace